#### ExternalResourceLoadData Members

---

|  |
| --- |
| ExternalResourceLoadData Class   Methods   Properties   See Also |

The  ExternalResourceLoadData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalResourceLoadData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetExternalResourceReference | Returns the ExternalResourceReference that identifies which resource should be loaded. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLoadContent | Returns the ExternalResourceLoadContent resulting from this load operation. |
| Public method | GetLoadContext | Returns an object containing information about the context of the load operation. |
| Public method | GetLoadRequestId | Returns the load operation GUID. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ErrorsReported | Indicates whether the IExternalResourceUIServer has reported errors for this ExternalResourceLoadData. This value can be set by the IExternalResourceUIServer in HandleLoadResourceResults(). |
| Public property | ExternalResourceType | The ExternalResourceType for which Revit is requesting data from the server. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LoadStatus | The success or failure status of the load attempt. |

# See Also

ExternalResourceLoadData Class

Autodesk.Revit.DB Namespace